---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteCross
source: html/e4ff1053-b04d-bd05-9cdd-f1dc33412bb2.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteCross

Defines parameters for parameterized concrete cross structural section.

## Syntax (C#)
```csharp
public class StructuralSectionConcreteCross : StructuralSectionRectangular
```